tags/4.0_rc2/tools/ServiceProfiles/profiles/examples/gea0101/incorrect1.xml

<?xml version="1.0" encoding="utf-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <soap-env:Header>
        <wsse:UsernameToken
            xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:Username>Bert</wsse:Username>
            <wsse:Password
                Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
                Ernie </wsse:Password>
            <wsse:Nonce>Pj+EzE2y5ckMDx5ovEvzWw==</wsse:Nonce>
            <wsu:Created>2004-05-11T12:05:16Z</wsu:Created>
        </wsse:UsernameToken>
    </soap-env:Header>
    <soap-env:Body>
        <m:InvalidStockSymbol xmlns:m="http://example.org/price">
            <symbol>ABCD</symbol>
        </m:InvalidStockSymbol>
    </soap-env:Body>
</soap-env:Envelope>
